{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\melin\OneDrive\ECO 727\Analysis\Exercise_2_Rueda.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}12 Jan 2025, 12:58:00
{txt}
{com}. global ex=2
{txt}
{com}. global lname="Rueda"
{txt}
{com}. global endyear=2024
{txt}
{com}. 
. * Importing data
. use "../Data/CPS ORGs, 1982-2024.dta", clear
{txt}
{com}. 
. * Running data check and dropping variables
. run data_check 
{txt}
{com}. drop serial cpsid cpsidp pernum hwtfinl wtfinl
{txt}
{com}. 
. *** End part A
. 
. * Recode missing values for categorical variables
. replace region = . if region == 97
{txt}(0 real changes made)

{com}. replace earnweek2 = . if inlist(earnweek2, 999999.98, 999999.97) // Recode missing values for earnweek2
{txt}(0 real changes made)

{com}. replace hourwage2 = . if hourwage2 == 999.99
{txt}(2,779,881 real changes made, 2,779,881 to missing)

{com}. replace sex = . if sex == 9
{txt}(0 real changes made)

{com}. replace race = . if race == 999
{txt}(0 real changes made)

{com}. replace empstat = . if empstat == 00
{txt}(0 real changes made)

{com}. replace occ1950 = . if inlist(occ1950, 997, 999)
{txt}(0 real changes made)

{com}. replace ind1950 = . if inlist(ind1950, 000, 001, 998, 999)
{txt}(0 real changes made)

{com}. replace classwkr = . if inlist(classwkr, 00, 99)
{txt}(0 real changes made)

{com}. replace uhrswork1 = . if uhrswork1 == 999
{txt}(0 real changes made)

{com}. replace educ = . if inlist(educ, 000, 001, 999)
{txt}(0 real changes made)

{com}. replace hourwage = . if hourwage == 999.99
{txt}(2,693,538 real changes made, 2,693,538 to missing)

{com}. replace paidhour = . if inlist(paidhour, 0, 6, 7) // Recode invalid responses as missing
{txt}(0 real changes made)

{com}. replace union = . if union == 0
{txt}(53 real changes made, 53 to missing)

{com}. replace earnweek = . if earnweek == 9999.99
{txt}(8,572 real changes made, 8,572 to missing)

{com}. replace uhrsworkorg = . if inlist(uhrsworkorg, 998, 999)
{txt}(2,646,162 real changes made, 2,646,162 to missing)

{com}. 
. * Generate female dummy variable
. generate female = (sex == 2)
{txt}
{com}. label variable female "female (1=yes, 0=no)"
{txt}
{com}. 
. * Create a proper dummy variable for paidhour
. generate paidhour_dummy = (paidhour == 1) if !missing(paidhour)
{txt}
{com}. label variable paidhour_dummy "paid hourly (1=yes, 0=no)"
{txt}
{com}. 
. * Generate new race variable with consistent categories
. generate race_orig = race  // Save original coding
{txt}
{com}. generate race_recode = .   // Create new variable for recoded race
{txt}(6,738,088 missing values generated)

{com}. 
. * Recode to consistent categories across all years
. replace race_recode = 1 if race == 100 // 1. white (non-hispanic)
{txt}(5,669,362 real changes made)

{com}. replace race_recode = 2 if race == 200 // 2. black
{txt}(647,759 real changes made)

{com}. replace race_recode = 3 if race == 300 // 3. american indian/aleut/eskimo
{txt}(56,015 real changes made)

{com}. replace race_recode = 4 if inlist(race, 650, 651, 652) // 4. asian/pacific islander
{txt}(263,406 real changes made)

{com}. replace race_recode = 5 if race == 700 // 5. other race
{txt}(45,931 real changes made)

{com}. replace race_recode = 6 if inrange(race, 801, 830) // 6. multiple races (combining all mixed categories)
{txt}(55,615 real changes made)

{com}. 
. * Label new race variable
. label define race_label 1 "white" 2 "black" 3 "american indian" ///
>                         4 "asian/pacific islander" 5 "other" 6 "multiple races"
{txt}
{com}. label values race_recode race_label
{txt}
{com}. label variable race_recode "race - consistent coding across years"
{txt}
{com}. 
. * Initialize occupation, industry, and grade variables
. generate occupation = .
{txt}(6,738,088 missing values generated)

{com}. generate industry = .
{txt}(6,738,088 missing values generated)

{com}. generate grade = .
{txt}(6,738,088 missing values generated)

{com}. 
. * Grade variable recoding
. * 1982-1991 grade recoding
. replace grade = 0 if educ == 2 & year <= 1991 // none or preschool
{txt}(3,693 real changes made)

{com}. replace grade = 1 if educ == 11 & year <= 1991
{txt}(827 real changes made)

{com}. replace grade = 2 if educ == 12 & year <= 1991
{txt}(2,023 real changes made)

{com}. replace grade = 3 if educ == 13 & year <= 1991
{txt}(3,228 real changes made)

{com}. replace grade = 4 if educ == 14 & year <= 1991
{txt}(4,010 real changes made)

{com}. replace grade = 5 if educ == 21 & year <= 1991
{txt}(5,261 real changes made)

{com}. replace grade = 6 if educ == 22 & year <= 1991
{txt}(13,252 real changes made)

{com}. replace grade = 7 if educ == 31 & year <= 1991
{txt}(11,324 real changes made)

{com}. replace grade = 8 if educ == 32 & year <= 1991
{txt}(37,861 real changes made)

{com}. replace grade = 9 if educ == 40 & year <= 1991
{txt}(38,411 real changes made)

{com}. replace grade = 10 if educ == 50 & year <= 1991
{txt}(56,240 real changes made)

{com}. replace grade = 11 if educ == 60 & year <= 1991
{txt}(60,845 real changes made)

{com}. replace grade = 12 if (educ == 72 | educ == 73) & year <= 1991 // 72 is 'diploma unclear'
{txt}(704,348 real changes made)

{com}. replace grade = 13 if educ == 80 & year <= 1991
{txt}(134,820 real changes made)

{com}. replace grade = 14 if educ == 90 & year <= 1991
{txt}(168,063 real changes made)

{com}. replace grade = 15 if educ == 100 & year <= 1991
{txt}(63,319 real changes made)

{com}. replace grade = 16 if educ == 110 & year <= 1991
{txt}(229,636 real changes made)

{com}. replace grade = 17 if educ == 121 & year <= 1991
{txt}(45,334 real changes made)

{com}. replace grade = 18 if educ == 122 & year <= 1991
{txt}(110,245 real changes made)

{com}. 
. * 1992-2024 grade recoding (Jaeger 1997)
. replace grade = 0 if educ == 2 & year >= 1992
{txt}(8,229 real changes made)

{com}. replace grade = 2.5 if educ == 10 & year >= 1992 // grades 1-4
{txt}(21,107 real changes made)

{com}. replace grade = 5.5 if educ == 20 & year >= 1992 // grades 5-6
{txt}(49,851 real changes made)

{com}. replace grade = 7.5 if educ == 30 & year >= 1992 // grades 7-8
{txt}(50,759 real changes made)

{com}. replace grade = 9 if educ == 40 & year >= 1992 // grade 9
{txt}(56,283 real changes made)

{com}. replace grade = 10 if educ == 50 & year >= 1992 // grade 10
{txt}(73,186 real changes made)

{com}. replace grade = 11 if educ == 60 & year >= 1992 // grade 11
{txt}(111,530 real changes made)

{com}. replace grade = 12 if (educ == 71 | educ == 73) & year >= 1992 // 71 is 'no diploma'
{txt}(1,558,364 real changes made)

{com}. replace grade = 13 if educ == 81 & year >= 1992 // some college, no degree
{txt}(977,528 real changes made)

{com}. replace grade = 14 if (educ == 91 | educ == 92) & year >= 1992 // academic or vocational associate's degree
{txt}(510,086 real changes made)

{com}. replace grade = 16 if educ == 111 & year >= 1992
{txt}(1,072,281 real changes made)

{com}. replace grade = 18 if inlist(educ, 123, 124, 125) & year >= 1992
{txt}(556,144 real changes made)

{com}. 
. * Order grade, before(educ)
. label variable grade "education (years)"
{txt}
{com}. 
. * 1982-2023 occupation recoding
. replace occupation = 1 if occ1950 >= 000 & occ1950 <= 099 // professional, technical
{txt}(1,637,521 real changes made)

{com}. replace occupation = 2 if occ1950 >= 100 & occ1950 <= 290 // managers, officials, proprietors
{txt}(850,339 real changes made)

{com}. replace occupation = 3 if occ1950 >= 300 & occ1950 <= 390 // clerical, kindred
{txt}(1,219,267 real changes made)

{com}. replace occupation = 4 if occ1950 >= 400 & occ1950 <= 490 // sales
{txt}(385,664 real changes made)

{com}. replace occupation = 5 if occ1950 >= 500 & occ1950 <= 594 // craftsmen
{txt}(656,513 real changes made)

{com}. replace occupation = 6 if occ1950 >= 600 & occ1950 <= 690 // operatives
{txt}(733,005 real changes made)

{com}. replace occupation = 7 if occ1950 >= 700 & occ1950 <= 720 // service (private hh)
{txt}(55,127 real changes made)

{com}. replace occupation = 8 if occ1950 >= 730 & occ1950 <= 790 // service (other)
{txt}(886,510 real changes made)

{com}. replace occupation = 9 if occ1950 >= 810 & occ1950 <= 970 // laborers
{txt}(314,142 real changes made)

{com}. replace occupation = 10 if occ1950 == 595 // armed forces
{txt}(0 real changes made)

{com}. 
. * 1982-2023 industry recoding
. replace industry = 1 if ind1950 >= 105 & ind1950 <= 239 // agriculture, fisheries, mining
{txt}(164,547 real changes made)

{com}. replace industry = 2 if ind1950 == 246 // construction
{txt}(387,651 real changes made)

{com}. replace industry = 3 if ind1950 >= 306 & ind1950 <= 399 // durable manufacturing
{txt}(624,816 real changes made)

{com}. replace industry = 4 if ind1950 >= 406 & ind1950 <= 499 // nondurable manufacturing
{txt}(402,224 real changes made)

{com}. replace industry = 5 if ind1950 >= 506 & ind1950 <= 598 // communications, transportation, utilities
{txt}(390,211 real changes made)

{com}. replace industry = 6 if ind1950 >= 606 & ind1950 <= 627 // wholesale trade
{txt}(213,824 real changes made)

{com}. replace industry = 7 if ind1950 >= 636 & ind1950 <= 699 // retail trade
{txt}(1,095,592 real changes made)

{com}. replace industry = 8 if (ind1950 >= 716 & ind1950 <= 746) | (ind1950 >= 868 & ind1950 <= 879) | (ind1950 >= 897 & ind1950 <= 899) // professional services, fire
{txt}(1,420,189 real changes made)

{com}. replace industry = 9 if inlist(ind1950, 888, 896) // education, welfare services
{txt}(838,993 real changes made)

{com}. replace industry = 10 if ind1950 >= 906 & ind1950 <= 936 // public administration
{txt}(431,596 real changes made)

{com}. replace industry = 11 if (ind1950 >= 806 & ind1950 <= 859) | inlist(ind1950, 997, 998) // other services
{txt}(768,445 real changes made)

{com}. 
. * Add value labels
. label define occupation 1 "professional, technical" 2 "managers, officials, proprietors" ///
>                         3 "clerical, kindred" 4 "sales" 5 "craftsmen" 6 "operatives" ///
>                         7 "service (private hh)" 8 "service (other)" 9 "laborers" ///
>                         10 "armed forces"
{txt}
{com}. 
. label define industry 1 "agriculture, fisheries, mining" 2 "construction" ///
>                       3 "durable manufacturing" 4 "nondurable manufacturing" ///
>                       5 "communications, transportation, utilities" 6 "wholesale trade" ///
>                       7 "retail trade" 8 "professional services, fire" ///
>                       9 "education, welfare services" 10 "public administration" ///
>                       11 "other services"
{txt}
{com}. 
. * Apply labels
. label values occupation occupation
{txt}
{com}. label values industry industry
{txt}
{com}. 
. * Add variable labels
. label variable occupation "occupation (1-10)"
{txt}
{com}. label variable industry "industry (1-11)"
{txt}
{com}. 
. * Error checking for recoding
. assert inlist(occupation, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, .) if !missing(occ1950)
{txt}
{com}. assert inlist(industry, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, .) if !missing(ind1950)
{txt}
{com}. 
. * Verify recoding
. tabulate year occupation if occupation != ., missing

    {txt}survey {c |}                   occupation (1-10)
      year {c |} professio  managers,  clerical,      sales  craftsmen {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
      1982 {c |}{res}    32,075     15,022     34,028     10,048     20,510 {txt}{c |}{res}   166,650 
{txt}      1983 {c |}{res}    30,844     16,706     33,677     10,019     19,309 {txt}{c |}{res}   165,175 
{txt}      1984 {c |}{res}    31,493     17,746     33,960     10,339     19,583 {txt}{c |}{res}   168,451 
{txt}      1985 {c |}{res}    32,690     18,789     34,838     10,671     19,819 {txt}{c |}{res}   171,614 
{txt}      1986 {c |}{res}    32,634     19,302     34,817     10,689     19,200 {txt}{c |}{res}   170,266 
{txt}      1987 {c |}{res}    32,879     19,694     35,005     10,809     19,122 {txt}{c |}{res}   171,247 
{txt}      1988 {c |}{res}    31,961     19,376     32,912     10,239     18,408 {txt}{c |}{res}   164,174 
{txt}      1989 {c |}{res}    32,972     20,237     33,014     10,366     18,629 {txt}{c |}{res}   167,612 
{txt}      1990 {c |}{res}    35,479     21,230     35,090     10,986     18,866 {txt}{c |}{res}   176,255 
{txt}      1991 {c |}{res}    35,175     20,822     33,912     10,643     17,782 {txt}{c |}{res}   171,296 
{txt}      1992 {c |}{res}    35,650     20,451     33,471     10,169     17,027 {txt}{c |}{res}   168,960 
{txt}      1993 {c |}{res}    35,354     20,409     32,720      9,949     16,378 {txt}{c |}{res}   166,714 
{txt}      1994 {c |}{res}    35,573     20,782     30,930      9,424     16,239 {txt}{c |}{res}   162,745 
{txt}      1995 {c |}{res}    36,112     21,613     29,838      9,714     16,211 {txt}{c |}{res}   162,261 
{txt}      1996 {c |}{res}    32,217     19,512     26,387      8,716     14,352 {txt}{c |}{res}   144,803 
{txt}      1997 {c |}{res}    33,254     20,113     26,568      8,926     14,760 {txt}{c |}{res}   147,540 
{txt}      1998 {c |}{res}    34,111     20,610     26,687      9,047     14,898 {txt}{c |}{res}   149,278 
{txt}      1999 {c |}{res}    35,622     21,125     26,269      8,975     15,141 {txt}{c |}{res}   151,471 
{txt}      2000 {c |}{res}    35,892     21,571     26,549      9,087     15,177 {txt}{c |}{res}   153,075 
{txt}      2001 {c |}{res}    40,307     24,139     28,521      9,931     16,797 {txt}{c |}{res}   167,851 
{txt}      2002 {c |}{res}    42,627     25,405     29,141     10,578     16,931 {txt}{c |}{res}   175,038 
{txt}      2003 {c |}{res}    42,666     20,653     32,748     10,044     17,183 {txt}{c |}{res}   171,861 
{txt}      2004 {c |}{res}    42,127     20,348     31,537     10,000     16,751 {txt}{c |}{res}   168,874 
{txt}      2005 {c |}{res}    42,676     20,414     31,498      9,853     17,073 {txt}{c |}{res}   169,927 
{txt}      2006 {c |}{res}    42,288     20,524     31,116      9,831     17,053 {txt}{c |}{res}   169,196 
{txt}      2007 {c |}{res}    43,023     20,397     30,341      9,953     16,299 {txt}{c |}{res}   167,451 
{txt}      2008 {c |}{res}    43,353     20,495     29,780      9,370     15,461 {txt}{c |}{res}   165,354 
{txt}      2009 {c |}{res}    43,164     20,152     28,688      8,992     14,120 {txt}{c |}{res}   160,565 
{txt}      2010 {c |}{res}    43,170     19,360     28,557      8,906     13,674 {txt}{c |}{res}   158,913 
{txt}      2011 {c |}{res}    43,023     19,155     27,900      8,591     13,373 {txt}{c |}{res}   157,142 
{txt}      2012 {c |}{res}    43,179     19,814     26,968      8,466     13,002 {txt}{c |}{res}   156,392 
{txt}      2013 {c |}{res}    43,276     19,845     26,491      8,333     13,099 {txt}{c |}{res}   155,715 
{txt}      2014 {c |}{res}    43,417     19,987     26,285      8,306     13,273 {txt}{c |}{res}   156,511 
{txt}      2015 {c |}{res}    43,622     19,866     25,561      8,133     13,128 {txt}{c |}{res}   154,485 
{txt}      2016 {c |}{res}    43,888     19,871     25,104      7,948     12,871 {txt}{c |}{res}   154,467 
{txt}      2017 {c |}{res}    43,774     19,915     24,162      7,888     12,765 {txt}{c |}{res}   152,074 
{txt}      2018 {c |}{res}    43,116     19,822     23,147      7,563     12,425 {txt}{c |}{res}   148,197 
{txt}      2019 {c |}{res}    42,109     19,058     22,353      6,999     11,993 {txt}{c |}{res}   142,895 
{txt}      2020 {c |}{res}    37,992     17,726     19,091      6,090     10,139 {txt}{c |}{res}   123,053 
{txt}      2021 {c |}{res}    37,414     17,616     19,141      5,971     10,219 {txt}{c |}{res}   123,429 
{txt}      2022 {c |}{res}    36,495     17,484     18,211      5,407      9,663 {txt}{c |}{res}   118,926 
{txt}      2023 {c |}{res}    35,666     17,475     17,073      5,077      9,246 {txt}{c |}{res}   114,984 
{txt}      2024 {c |}{res}    33,162     15,708     15,181      4,618      8,564 {txt}{c |}{res}   105,201 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 1,637,521    850,339  1,219,267    385,664    656,513 {txt}{c |}{res} 6,738,088 


    {txt}survey {c |}              occupation (1-10)
      year {c |} operative  service (  service (   laborers {c |}     Total
{hline 11}{c +}{hline 44}{c +}{hline 10}
      1982 {c |}{res}    23,678      1,478     20,755      9,056 {txt}{c |}{res}   166,650 
{txt}      1983 {c |}{res}    22,591      1,405     21,423      9,201 {txt}{c |}{res}   165,175 
{txt}      1984 {c |}{res}    23,285      1,470     21,139      9,436 {txt}{c |}{res}   168,451 
{txt}      1985 {c |}{res}    23,095      1,417     21,302      8,993 {txt}{c |}{res}   171,614 
{txt}      1986 {c |}{res}    22,342      1,357     21,012      8,913 {txt}{c |}{res}   170,266 
{txt}      1987 {c |}{res}    22,476      1,220     21,139      8,903 {txt}{c |}{res}   171,247 
{txt}      1988 {c |}{res}    21,198      1,125     20,204      8,751 {txt}{c |}{res}   164,174 
{txt}      1989 {c |}{res}    21,774      1,084     20,688      8,848 {txt}{c |}{res}   167,612 
{txt}      1990 {c |}{res}    22,309      1,057     21,890      9,348 {txt}{c |}{res}   176,255 
{txt}      1991 {c |}{res}    21,144      1,059     21,860      8,899 {txt}{c |}{res}   171,296 
{txt}      1992 {c |}{res}    20,466      1,164     21,894      8,668 {txt}{c |}{res}   168,960 
{txt}      1993 {c |}{res}    20,377      1,150     22,013      8,364 {txt}{c |}{res}   166,714 
{txt}      1994 {c |}{res}    19,470      1,015     21,108      8,204 {txt}{c |}{res}   162,745 
{txt}      1995 {c |}{res}    19,005      1,028     20,551      8,189 {txt}{c |}{res}   162,261 
{txt}      1996 {c |}{res}    16,750        915     18,522      7,432 {txt}{c |}{res}   144,803 
{txt}      1997 {c |}{res}    16,894        893     18,774      7,358 {txt}{c |}{res}   147,540 
{txt}      1998 {c |}{res}    16,708        936     18,939      7,342 {txt}{c |}{res}   149,278 
{txt}      1999 {c |}{res}    16,596        936     19,172      7,635 {txt}{c |}{res}   151,471 
{txt}      2000 {c |}{res}    16,686        876     19,328      7,909 {txt}{c |}{res}   153,075 
{txt}      2001 {c |}{res}    17,309        883     21,658      8,306 {txt}{c |}{res}   167,851 
{txt}      2002 {c |}{res}    17,525        861     23,136      8,834 {txt}{c |}{res}   175,038 
{txt}      2003 {c |}{res}    17,505      1,784     22,582      6,696 {txt}{c |}{res}   171,861 
{txt}      2004 {c |}{res}    16,953      1,738     22,573      6,847 {txt}{c |}{res}   168,874 
{txt}      2005 {c |}{res}    17,085      1,698     22,647      6,983 {txt}{c |}{res}   169,927 
{txt}      2006 {c |}{res}    16,831      1,766     22,556      7,231 {txt}{c |}{res}   169,196 
{txt}      2007 {c |}{res}    16,427      1,695     22,275      7,041 {txt}{c |}{res}   167,451 
{txt}      2008 {c |}{res}    15,924      1,643     22,516      6,812 {txt}{c |}{res}   165,354 
{txt}      2009 {c |}{res}    14,373      1,669     23,212      6,195 {txt}{c |}{res}   160,565 
{txt}      2010 {c |}{res}    14,430      1,613     23,261      5,942 {txt}{c |}{res}   158,913 
{txt}      2011 {c |}{res}    14,496      1,602     22,895      6,107 {txt}{c |}{res}   157,142 
{txt}      2012 {c |}{res}    14,784      1,534     22,537      6,108 {txt}{c |}{res}   156,392 
{txt}      2013 {c |}{res}    14,685      1,471     22,400      6,115 {txt}{c |}{res}   155,715 
{txt}      2014 {c |}{res}    14,694      1,584     22,442      6,523 {txt}{c |}{res}   156,511 
{txt}      2015 {c |}{res}    14,613      1,575     21,684      6,303 {txt}{c |}{res}   154,485 
{txt}      2016 {c |}{res}    14,632      1,453     22,166      6,534 {txt}{c |}{res}   154,467 
{txt}      2017 {c |}{res}    14,393      1,378     21,319      6,480 {txt}{c |}{res}   152,074 
{txt}      2018 {c |}{res}    14,051      1,402     20,422      6,249 {txt}{c |}{res}   148,197 
{txt}      2019 {c |}{res}    13,200      1,360     19,611      6,212 {txt}{c |}{res}   142,895 
{txt}      2020 {c |}{res}    10,909        895     14,999      5,212 {txt}{c |}{res}   123,053 
{txt}      2021 {c |}{res}    11,338      1,040     15,345      5,345 {txt}{c |}{res}   123,429 
{txt}      2022 {c |}{res}    10,626      1,022     14,893      5,125 {txt}{c |}{res}   118,926 
{txt}      2023 {c |}{res}    10,235        989     14,351      4,872 {txt}{c |}{res}   114,984 
{txt}      2024 {c |}{res}     9,143        887     13,317      4,621 {txt}{c |}{res}   105,201 
{txt}{hline 11}{c +}{hline 44}{c +}{hline 10}
     Total {c |}{res}   733,005     55,127    886,510    314,142 {txt}{c |}{res} 6,738,088 
{txt}
{com}. tabulate year industry if industry != ., missing

    {txt}survey {c |}                    industry (1-11)
      year {c |} agricultu  construct  durable m  nondurabl  communica {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
      1982 {c |}{res}     5,473      8,378     22,009     14,526     11,795 {txt}{c |}{res}   166,650 
{txt}      1983 {c |}{res}     5,088      8,891     21,120     13,940     10,912 {txt}{c |}{res}   165,175 
{txt}      1984 {c |}{res}     4,884      9,336     22,546     13,971     11,179 {txt}{c |}{res}   168,451 
{txt}      1985 {c |}{res}     4,540      9,488     22,554     14,008     11,492 {txt}{c |}{res}   171,614 
{txt}      1986 {c |}{res}     4,180      9,593     22,008     13,786     11,070 {txt}{c |}{res}   170,266 
{txt}      1987 {c |}{res}     4,049      9,645     21,613     13,727     11,083 {txt}{c |}{res}   171,247 
{txt}      1988 {c |}{res}     3,889      9,250     20,400     12,946     10,797 {txt}{c |}{res}   164,174 
{txt}      1989 {c |}{res}     3,903      9,335     20,456     13,407     10,895 {txt}{c |}{res}   167,612 
{txt}      1990 {c |}{res}     4,053      9,657     21,071     13,530     11,457 {txt}{c |}{res}   176,255 
{txt}      1991 {c |}{res}     3,927      8,583     19,744     13,092     11,180 {txt}{c |}{res}   171,296 
{txt}      1992 {c |}{res}     3,723      8,232     18,670     12,789     10,866 {txt}{c |}{res}   168,960 
{txt}      1993 {c |}{res}     3,625      8,185     18,141     12,049     10,721 {txt}{c |}{res}   166,714 
{txt}      1994 {c |}{res}     3,390      8,133     17,830     11,581     10,418 {txt}{c |}{res}   162,745 
{txt}      1995 {c |}{res}     3,373      8,302     17,503     11,409     10,238 {txt}{c |}{res}   162,261 
{txt}      1996 {c |}{res}     3,241      7,735     15,411      9,603      9,091 {txt}{c |}{res}   144,803 
{txt}      1997 {c |}{res}     3,258      7,980     15,691      9,641      9,333 {txt}{c |}{res}   147,540 
{txt}      1998 {c |}{res}     3,280      8,227     15,712      9,175      9,519 {txt}{c |}{res}   149,278 
{txt}      1999 {c |}{res}     3,241      8,665     15,427      8,918      9,817 {txt}{c |}{res}   151,471 
{txt}      2000 {c |}{res}     3,300      9,217     15,126      8,845     10,073 {txt}{c |}{res}   153,075 
{txt}      2001 {c |}{res}     3,586     10,338     15,791      9,194     10,769 {txt}{c |}{res}   167,851 
{txt}      2002 {c |}{res}     3,642     10,610     15,330      9,294     11,075 {txt}{c |}{res}   175,038 
{txt}      2003 {c |}{res}     3,664     10,670     14,004      9,575      8,940 {txt}{c |}{res}   171,861 
{txt}      2004 {c |}{res}     3,594     10,857     13,510      9,063      8,445 {txt}{c |}{res}   168,874 
{txt}      2005 {c |}{res}     3,682     11,417     13,344      8,724      8,514 {txt}{c |}{res}   169,927 
{txt}      2006 {c |}{res}     3,945     11,743     13,063      8,555      8,575 {txt}{c |}{res}   169,196 
{txt}      2007 {c |}{res}     3,929     11,437     12,468      8,450      8,552 {txt}{c |}{res}   167,451 
{txt}      2008 {c |}{res}     3,894     10,338     12,379      7,895      8,536 {txt}{c |}{res}   165,354 
{txt}      2009 {c |}{res}     3,766      9,074     10,904      7,372      8,022 {txt}{c |}{res}   160,565 
{txt}      2010 {c |}{res}     3,765      8,284     10,518      7,254      8,018 {txt}{c |}{res}   158,913 
{txt}      2011 {c |}{res}     3,978      8,315     10,555      7,162      7,743 {txt}{c |}{res}   157,142 
{txt}      2012 {c |}{res}     4,209      8,174     10,739      7,040      7,715 {txt}{c |}{res}   156,392 
{txt}      2013 {c |}{res}     4,186      8,409     10,675      7,166      7,650 {txt}{c |}{res}   155,715 
{txt}      2014 {c |}{res}     4,439      8,840     10,643      7,031      7,773 {txt}{c |}{res}   156,511 
{txt}      2015 {c |}{res}     4,418      8,751     10,382      6,803      7,510 {txt}{c |}{res}   154,485 
{txt}      2016 {c |}{res}     4,223      8,997     10,317      6,862      7,504 {txt}{c |}{res}   154,467 
{txt}      2017 {c |}{res}     4,196      9,093     10,033      6,668      7,615 {txt}{c |}{res}   152,074 
{txt}      2018 {c |}{res}     4,036      9,114      9,826      6,418      7,522 {txt}{c |}{res}   148,197 
{txt}      2019 {c |}{res}     3,841      8,932      9,472      6,202      7,155 {txt}{c |}{res}   142,895 
{txt}      2020 {c |}{res}     3,279      7,613      8,017      5,230      6,271 {txt}{c |}{res}   123,053 
{txt}      2021 {c |}{res}     3,160      7,800      8,047      5,140      6,381 {txt}{c |}{res}   123,429 
{txt}      2022 {c |}{res}     2,957      7,638      7,677      4,962      6,287 {txt}{c |}{res}   118,926 
{txt}      2023 {c |}{res}     2,969      7,474      7,507      4,975      6,153 {txt}{c |}{res}   114,984 
{txt}      2024 {c |}{res}     2,772      6,901      6,583      4,246      5,550 {txt}{c |}{res}   105,201 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res}   164,547    387,651    624,816    402,224    390,211 {txt}{c |}{res} 6,738,088 


    {txt}survey {c |}                    industry (1-11)
      year {c |} wholesale  retail tr  professio  education  public ad {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
      1982 {c |}{res}     6,648     25,554     28,176     19,103     10,732 {txt}{c |}{res}   166,650 
{txt}      1983 {c |}{res}     6,538     25,821     27,957     18,972     11,080 {txt}{c |}{res}   165,175 
{txt}      1984 {c |}{res}     6,312     26,536     28,102     18,966     10,884 {txt}{c |}{res}   168,451 
{txt}      1985 {c |}{res}     6,519     27,044     28,800     19,519     11,090 {txt}{c |}{res}   171,614 
{txt}      1986 {c |}{res}     6,299     26,650     29,729     19,221     11,172 {txt}{c |}{res}   170,266 
{txt}      1987 {c |}{res}     6,545     26,755     30,440     19,310     11,168 {txt}{c |}{res}   171,247 
{txt}      1988 {c |}{res}     6,103     25,369     29,113     18,857     10,896 {txt}{c |}{res}   164,174 
{txt}      1989 {c |}{res}     6,257     26,205     29,698     19,416     10,981 {txt}{c |}{res}   167,612 
{txt}      1990 {c |}{res}     6,454     27,698     32,116     20,713     11,441 {txt}{c |}{res}   176,255 
{txt}      1991 {c |}{res}     6,351     26,940     31,821     20,456     11,240 {txt}{c |}{res}   171,296 
{txt}      1992 {c |}{res}     6,449     26,797     32,234     20,681     10,828 {txt}{c |}{res}   168,960 
{txt}      1993 {c |}{res}     6,002     26,855     32,117     20,624     10,784 {txt}{c |}{res}   166,714 
{txt}      1994 {c |}{res}     5,869     25,802     31,112     20,442     10,573 {txt}{c |}{res}   162,745 
{txt}      1995 {c |}{res}     5,981     25,926     30,984     19,988     10,598 {txt}{c |}{res}   162,261 
{txt}      1996 {c |}{res}     5,408     23,397     27,381     17,926      9,210 {txt}{c |}{res}   144,803 
{txt}      1997 {c |}{res}     5,305     23,419     28,278     18,159      9,220 {txt}{c |}{res}   147,540 
{txt}      1998 {c |}{res}     5,480     23,800     28,603     18,593      9,224 {txt}{c |}{res}   149,278 
{txt}      1999 {c |}{res}     5,667     23,943     28,764     19,377      9,388 {txt}{c |}{res}   151,471 
{txt}      2000 {c |}{res}     5,929     24,015     28,717     19,382      9,363 {txt}{c |}{res}   153,075 
{txt}      2001 {c |}{res}     6,162     26,567     32,310     21,773     10,312 {txt}{c |}{res}   167,851 
{txt}      2002 {c |}{res}     6,282     28,131     34,863     23,249     11,036 {txt}{c |}{res}   175,038 
{txt}      2003 {c |}{res}     5,355     28,585     39,157     21,880     10,744 {txt}{c |}{res}   171,861 
{txt}      2004 {c |}{res}     5,450     28,322     38,454     21,691     10,596 {txt}{c |}{res}   168,874 
{txt}      2005 {c |}{res}     5,235     28,694     39,147     21,569     10,787 {txt}{c |}{res}   169,927 
{txt}      2006 {c |}{res}     5,322     28,052     39,065     21,455     10,603 {txt}{c |}{res}   169,196 
{txt}      2007 {c |}{res}     4,994     27,453     38,742     21,624     10,645 {txt}{c |}{res}   167,451 
{txt}      2008 {c |}{res}     4,532     27,811     38,723     21,403     10,619 {txt}{c |}{res}   165,354 
{txt}      2009 {c |}{res}     4,277     27,694     38,370     21,521     10,625 {txt}{c |}{res}   160,565 
{txt}      2010 {c |}{res}     4,199     27,362     38,800     21,242     10,599 {txt}{c |}{res}   158,913 
{txt}      2011 {c |}{res}     4,108     27,141     37,781     20,748     10,284 {txt}{c |}{res}   157,142 
{txt}      2012 {c |}{res}     4,024     27,240     37,821     20,358      9,769 {txt}{c |}{res}   156,392 
{txt}      2013 {c |}{res}     3,820     26,971     37,911     20,061      9,673 {txt}{c |}{res}   155,715 
{txt}      2014 {c |}{res}     3,785     27,067     37,636     20,050      9,672 {txt}{c |}{res}   156,511 
{txt}      2015 {c |}{res}     3,726     26,714     37,120     20,148      9,540 {txt}{c |}{res}   154,485 
{txt}      2016 {c |}{res}     3,651     26,509     37,352     19,964      9,519 {txt}{c |}{res}   154,467 
{txt}      2017 {c |}{res}     3,558     25,856     36,676     19,583      9,494 {txt}{c |}{res}   152,074 
{txt}      2018 {c |}{res}     3,479     24,733     35,736     18,883      9,396 {txt}{c |}{res}   148,197 
{txt}      2019 {c |}{res}     3,171     23,419     34,954     18,276      8,812 {txt}{c |}{res}   142,895 
{txt}      2020 {c |}{res}     2,883     19,238     30,931     15,900      8,488 {txt}{c |}{res}   123,053 
{txt}      2021 {c |}{res}     2,826     19,949     30,613     15,569      8,142 {txt}{c |}{res}   123,429 
{txt}      2022 {c |}{res}     2,413     18,966     29,466     14,878      7,769 {txt}{c |}{res}   118,926 
{txt}      2023 {c |}{res}     2,326     18,008     28,230     14,291      7,659 {txt}{c |}{res}   114,984 
{txt}      2024 {c |}{res}     2,130     16,584     26,189     13,172      6,941 {txt}{c |}{res}   105,201 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res}   213,824  1,095,592  1,420,189    838,993    431,596 {txt}{c |}{res} 6,738,088 


           {txt}{c |}  industry
    survey {c |}   (1-11)
      year {c |} other ser {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
      1982 {c |}{res}    14,256 {txt}{c |}{res}   166,650 
{txt}      1983 {c |}{res}    14,856 {txt}{c |}{res}   165,175 
{txt}      1984 {c |}{res}    15,735 {txt}{c |}{res}   168,451 
{txt}      1985 {c |}{res}    16,560 {txt}{c |}{res}   171,614 
{txt}      1986 {c |}{res}    16,558 {txt}{c |}{res}   170,266 
{txt}      1987 {c |}{res}    16,912 {txt}{c |}{res}   171,247 
{txt}      1988 {c |}{res}    16,554 {txt}{c |}{res}   164,174 
{txt}      1989 {c |}{res}    17,059 {txt}{c |}{res}   167,612 
{txt}      1990 {c |}{res}    18,065 {txt}{c |}{res}   176,255 
{txt}      1991 {c |}{res}    17,962 {txt}{c |}{res}   171,296 
{txt}      1992 {c |}{res}    17,691 {txt}{c |}{res}   168,960 
{txt}      1993 {c |}{res}    17,611 {txt}{c |}{res}   166,714 
{txt}      1994 {c |}{res}    17,595 {txt}{c |}{res}   162,745 
{txt}      1995 {c |}{res}    17,959 {txt}{c |}{res}   162,261 
{txt}      1996 {c |}{res}    16,400 {txt}{c |}{res}   144,803 
{txt}      1997 {c |}{res}    17,256 {txt}{c |}{res}   147,540 
{txt}      1998 {c |}{res}    17,665 {txt}{c |}{res}   149,278 
{txt}      1999 {c |}{res}    18,264 {txt}{c |}{res}   151,471 
{txt}      2000 {c |}{res}    19,108 {txt}{c |}{res}   153,075 
{txt}      2001 {c |}{res}    21,049 {txt}{c |}{res}   167,851 
{txt}      2002 {c |}{res}    21,526 {txt}{c |}{res}   175,038 
{txt}      2003 {c |}{res}    19,287 {txt}{c |}{res}   171,861 
{txt}      2004 {c |}{res}    18,892 {txt}{c |}{res}   168,874 
{txt}      2005 {c |}{res}    18,814 {txt}{c |}{res}   169,927 
{txt}      2006 {c |}{res}    18,818 {txt}{c |}{res}   169,196 
{txt}      2007 {c |}{res}    19,157 {txt}{c |}{res}   167,451 
{txt}      2008 {c |}{res}    19,224 {txt}{c |}{res}   165,354 
{txt}      2009 {c |}{res}    18,940 {txt}{c |}{res}   160,565 
{txt}      2010 {c |}{res}    18,872 {txt}{c |}{res}   158,913 
{txt}      2011 {c |}{res}    19,327 {txt}{c |}{res}   157,142 
{txt}      2012 {c |}{res}    19,303 {txt}{c |}{res}   156,392 
{txt}      2013 {c |}{res}    19,193 {txt}{c |}{res}   155,715 
{txt}      2014 {c |}{res}    19,575 {txt}{c |}{res}   156,511 
{txt}      2015 {c |}{res}    19,373 {txt}{c |}{res}   154,485 
{txt}      2016 {c |}{res}    19,569 {txt}{c |}{res}   154,467 
{txt}      2017 {c |}{res}    19,302 {txt}{c |}{res}   152,074 
{txt}      2018 {c |}{res}    19,054 {txt}{c |}{res}   148,197 
{txt}      2019 {c |}{res}    18,661 {txt}{c |}{res}   142,895 
{txt}      2020 {c |}{res}    15,203 {txt}{c |}{res}   123,053 
{txt}      2021 {c |}{res}    15,802 {txt}{c |}{res}   123,429 
{txt}      2022 {c |}{res}    15,913 {txt}{c |}{res}   118,926 
{txt}      2023 {c |}{res}    15,392 {txt}{c |}{res}   114,984 
{txt}      2024 {c |}{res}    14,133 {txt}{c |}{res}   105,201 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res}   768,445 {txt}{c |}{res} 6,738,088 
{txt}
{com}. 
. * Check that industry contains all instances of ind1950
. count if !missing(ind1950) & missing(industry)
  {res}0
{txt}
{com}. if r(N) > 0 {c -(}
.     display "WARNING: There are " r(N) " instances where ind1950 is non-missing but industry is missing."
. {c )-}
{txt}
{com}. else {c -(}
.     display "All instances of ind1950 have been successfully recoded into industry."
{res}All instances of ind1950 have been successfully recoded into industry.
{com}. {c )-}
{txt}
{com}. 
. * Check that no instances are missing from industry compared to ind1950
. count if !missing(industry) & missing(ind1950)
  {res}0
{txt}
{com}. if r(N) > 0 {c -(}
.     display "WARNING: There are " r(N) " instances where industry is non-missing but ind1950 is missing."
. {c )-}
{txt}
{com}. else {c -(}
.     display "No instances are missing from industry compared to ind1950."
{res}No instances are missing from industry compared to ind1950.
{com}. {c )-}
{txt}
{com}. 
. * Get max value of earnweek2 for recent period before any replacements
. summarize earnweek2 if (year==2023 & month>=4) | (year==2024 & month<=3), detail

                  {txt}weekly earnings (rounded)
{hline 61}
      Percentiles      Smallest
 1%    {res}      108              4
{txt} 5%    {res}      288              4
{txt}10%    {res}      416              4       {txt}Obs         {res}    115,288
{txt}25%    {res}      680              4       {txt}Sum of wgt. {res}    115,288

{txt}50%    {res}     1016                      {txt}Mean          {res} 2588.129
                        {txt}Largest       Std. dev.     {res} 35294.54
{txt}75%    {res}     1630        1000000
{txt}90%    {res}     2560        1000000       {txt}Variance      {res} 1.25e+09
{txt}95%    {res}  2884.61        1000000       {txt}Skewness      {res} 28.18935
{txt}99%    {res}  8672.01        1000000       {txt}Kurtosis      {res} 796.6248
{txt}
{com}. return list

{txt}scalars:
                  r(N) =  {res}115288
              {txt}r(sum_w) =  {res}115288
               {txt}r(mean) =  {res}2588.1294453022
                {txt}r(Var) =  {res}1245704747.004343
                 {txt}r(sd) =  {res}35294.54273686434
           {txt}r(skewness) =  {res}28.18934578750244
           {txt}r(kurtosis) =  {res}796.6247763236568
                {txt}r(sum) =  {res}298380267.49
                {txt}r(min) =  {res}4
                {txt}r(max) =  {res}999999.99
                 {txt}r(p1) =  {res}108
                 {txt}r(p5) =  {res}288
                {txt}r(p10) =  {res}416
                {txt}r(p25) =  {res}680
                {txt}r(p50) =  {res}1016
                {txt}r(p75) =  {res}1630
                {txt}r(p90) =  {res}2560
                {txt}r(p95) =  {res}2884.61
                {txt}r(p99) =  {res}8672.01
{txt}
{com}. scalar max_earnweek2 = r(max)
{txt}
{com}. 
. * Store the max value for verification
. gen max_val = r(max) if _n == 1
{txt}(6,738,087 missing values generated)

{com}. display "Maximum value of earnweek2 for recent period: " max_earnweek2
{res}Maximum value of earnweek2 for recent period: 999999.99
{txt}
{com}. 
. * Replace missing values with rounded values from earnweek2 and hourwage2
. replace earnweek = earnweek2 if missing(earnweek) & month>=4 & year>=2023
{txt}(163,735 real changes made)

{com}. replace hourwage = hourwage2 if missing(hourwage) & month>=4 & year>=2023
{txt}(90,163 real changes made)

{com}. 
. * Create topcode variable for earnweek
. generate topcode = .
{txt}(6,738,088 missing values generated)

{com}. label variable topcode "top-coded earnweek (1=yes, 0=no)"
{txt}
{com}. 
. * Identify topcoded values by period
. replace topcode = 1 if earnweek == 999  & inrange(year, 1982, 1988) // 1982-1988
{txt}(34,917 real changes made)

{com}. replace topcode = 1 if earnweek == 1923 & inrange(year, 1989, 1997) // 1989-1997
{txt}(14,628 real changes made)

{com}. replace topcode = 1 if (earnweek == 2885 | earnweek == 2884.61) & inrange(year, 1998, 2022) // 1998-2022
{txt}(94,369 real changes made)

{com}. replace topcode = 1 if earnweek == 2884.61 & year == 2023 & month <= 3 & mish == 4 // April 2023-March 2024, MISH 4
{txt}(1,008 real changes made)

{com}. replace topcode = 1 if earnweek == 2884.61 & year == 2023 & mish == 8 // April 2023-March 2024, MISH 8
{txt}(4,409 real changes made)

{com}. replace topcode = 1 if earnweek == 2884.61 & year == 2024 & month <= 3 & mish == 8 // April 2023-March 2024, MISH 8
{txt}(0 real changes made)

{com}. replace topcode = 0 if missing(topcode) & !missing(earnweek)
{txt}(6,551,808 real changes made)

{com}. 
. * Verify topcoding implementation
. display "Verifying topcode implementation..."
{res}Verifying topcode implementation...
{txt}
{com}. count if missing(topcode) & !missing(earnweek)
  {res}0
{txt}
{com}. tab year topcode if year >= 2023, col
{txt}
{c TLC}{hline 19}{c TRC}
{c |} Key{col 21}{c |}
{c LT}{hline 19}{c RT}
{c |}{space 5}{it:frequency}{col 21}{c |}
{c |}{space 1}{it:column percentage}{col 21}{c |}
{c BLC}{hline 19}{c BRC}

           {c |}  top-coded earnweek
    survey {c |}     (1=yes, 0=no)
      year {c |}         0          1 {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
      2023 {c |}{res}   109,540      5,417 {txt}{c |}{res}   114,957 
           {txt}{c |}{res}     58.78     100.00 {txt}{c |}{res}     59.94 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
      2024 {c |}{res}    76,824          0 {txt}{c |}{res}    76,824 
           {txt}{c |}{res}     41.22       0.00 {txt}{c |}{res}     40.06 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}   186,364      5,417 {txt}{c |}{res}   191,781 
           {txt}{c |}{res}    100.00     100.00 {txt}{c |}{res}    100.00 
{txt}
{com}. tab month topcode if year == 2024, col
{txt}
{c TLC}{hline 19}{c TRC}
{c |} Key{col 21}{c |}
{c LT}{hline 19}{c RT}
{c |}{space 5}{it:frequency}{col 21}{c |}
{c |}{space 1}{it:column percentage}{col 21}{c |}
{c BLC}{hline 19}{c BRC}

           {c |} top-coded
           {c |}  earnweek
           {c |}  (1=yes,
           {c |}   0=no)
     month {c |}         0 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
     april {c |}{res}     9,534 {txt}{c |}{res}     9,534 
           {txt}{c |}{res}     12.41 {txt}{c |}{res}     12.41 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
       may {c |}{res}     9,635 {txt}{c |}{res}     9,635 
           {txt}{c |}{res}     12.54 {txt}{c |}{res}     12.54 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
      june {c |}{res}     9,642 {txt}{c |}{res}     9,642 
           {txt}{c |}{res}     12.55 {txt}{c |}{res}     12.55 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
      july {c |}{res}     9,472 {txt}{c |}{res}     9,472 
           {txt}{c |}{res}     12.33 {txt}{c |}{res}     12.33 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
    august {c |}{res}     9,653 {txt}{c |}{res}     9,653 
           {txt}{c |}{res}     12.57 {txt}{c |}{res}     12.57 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
 september {c |}{res}     9,601 {txt}{c |}{res}     9,601 
           {txt}{c |}{res}     12.50 {txt}{c |}{res}     12.50 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
   october {c |}{res}     9,600 {txt}{c |}{res}     9,600 
           {txt}{c |}{res}     12.50 {txt}{c |}{res}     12.50 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
  november {c |}{res}     9,687 {txt}{c |}{res}     9,687 
           {txt}{c |}{res}     12.61 {txt}{c |}{res}     12.61 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res}    76,824 {txt}{c |}{res}    76,824 
           {txt}{c |}{res}    100.00 {txt}{c |}{res}    100.00 
{txt}
{com}. tab mish topcode if year == 2024, col
{txt}
{c TLC}{hline 19}{c TRC}
{c |} Key{col 21}{c |}
{c LT}{hline 19}{c RT}
{c |}{space 5}{it:frequency}{col 21}{c |}
{c |}{space 1}{it:column percentage}{col 21}{c |}
{c BLC}{hline 19}{c BRC}

           {c |} top-coded
  month in {c |}  earnweek
   sample, {c |}  (1=yes,
 household {c |}   0=no)
     level {c |}         0 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
      four {c |}{res}    38,113 {txt}{c |}{res}    38,113 
           {txt}{c |}{res}     49.61 {txt}{c |}{res}     49.61 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     eight {c |}{res}    38,711 {txt}{c |}{res}    38,711 
           {txt}{c |}{res}     50.39 {txt}{c |}{res}     50.39 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res}    76,824 {txt}{c |}{res}    76,824 
           {txt}{c |}{res}    100.00 {txt}{c |}{res}    100.00 
{txt}
{com}. 
. * Now safe to drop earnweek2 and hourwage2
. drop earnweek2 hourwage2
{txt}
{com}. 
. *** End part B
. 
. * Compress and save the cleaned data
. compress
  {txt}variable {bf}{res}uhrsworkorg{sf}{txt} was {bf}{res}int{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}female{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}paidhour_dummy{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}race_orig{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}race_recode{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}occupation{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}industry{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}topcode{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (141,499,848 bytes saved)

{com}. save "../Data/CPS ORGs, 1982-2024, Cleaned.dta", replace
{txt}{p 0 4 2}
file {bf}
../Data/CPS ORGs, 1982-2024, Cleaned.dta{rm}
saved
{p_end}

{com}. 
. * Describe and summarize the final dataset
. describe

{txt}Contains data from {res}../Data/CPS ORGs, 1982-2024, Cleaned.dta
{txt} Observations:{res}     6,738,088                  
{txt}    Variables:{res}            30                  12 Jan 2025 12:58
{txt}{hline}
Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:year           }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}survey year{p_end}
{p 0 48}{bind:month          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:MONTH    }{bind:  }{res}{res}month{p_end}
{p 0 48}{bind:mish           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:MISH     }{bind:  }{res}{res}month in sample, household level{p_end}
{p 0 48}{bind:region         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:REGION   }{bind:  }{res}{res}region and division{p_end}
{p 0 48}{bind:cpsidv         }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}validated longitudinal identifier{p_end}
{p 0 48}{bind:age            }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:AGE      }{bind:  }{res}{res}age{p_end}
{p 0 48}{bind:sex            }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:SEX      }{bind:  }{res}{res}sex{p_end}
{p 0 48}{bind:race           }{txt}{bind: int     }{bind:%58.0g    }{space 1}{bind:RACE     }{bind:  }{res}{res}race{p_end}
{p 0 48}{bind:empstat        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:EMPSTAT  }{bind:  }{res}{res}employment status{p_end}
{p 0 48}{bind:occ1950        }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:OCC1950  }{bind:  }{res}{res}occupation, 1950 basis{p_end}
{p 0 48}{bind:ind1950        }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:IND1950  }{bind:  }{res}{res}industry, 1950 basis{p_end}
{p 0 48}{bind:classwkr       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CLASSWKR }{bind:  }{res}{res}class of worker{p_end}
{p 0 48}{bind:uhrswork1      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{txt}UHRSWORK1{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}hours usually worked per week at main job{p_end}
{p 0 48}{bind:educ           }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:EDUC     }{bind:  }{res}{res}educational attainment recode{p_end}
{p 0 48}{bind:earnwt         }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}earnings weight{p_end}
{p 0 48}{bind:qearnwee       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:QEARNWEE }{bind:  }{res}{res}data quality flag for earnweek{p_end}
{p 0 48}{bind:hourwage       }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:HOURWAGE }{bind:  }{res}{res}hourly wage{p_end}
{p 0 48}{bind:paidhour       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PAIDHOUR }{bind:  }{res}{res}paid by the hour{p_end}
{p 0 48}{bind:union          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:UNION    }{bind:  }{res}{res}union membership{p_end}
{p 0 48}{bind:earnweek       }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:EARNWEEK }{bind:  }{res}{res}weekly earnings{p_end}
{p 0 48}{bind:uhrsworkorg    }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}usual hours worked per week, outgoing rotation groups{p_end}
{p 0 48}{bind:female         }{txt}{bind: byte    }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}female (1=yes, 0=no){p_end}
{p 0 48}{bind:paidhour_dummy }{txt}{bind: byte    }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}paid hourly (1=yes, 0=no){p_end}
{p 0 48}{bind:race_orig      }{txt}{bind: int     }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:race_recode    }{txt}{bind: byte    }{bind:%22.0g    }{space 1}{txt}race_label{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}race - consistent coding across years{p_end}
{p 0 48}{bind:occupation     }{txt}{bind: byte    }{bind:%32.0g    }{space 1}{txt}occupation{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}occupation (1-10){p_end}
{p 0 48}{bind:industry       }{txt}{bind: byte    }{bind:%41.0g    }{space 1}{bind:industry }{bind:  }{res}{res}industry (1-11){p_end}
{p 0 48}{bind:grade          }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}education (years){p_end}
{p 0 48}{bind:max_val        }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:topcode        }{txt}{bind: byte    }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}top-coded earnweek (1=yes, 0=no){p_end}
{txt}{hline}
Sorted by: 

{com}. summarize

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}year {c |}{res}  6,738,088    2002.068    12.10799       1982       2024
{txt}{space 7}month {c |}{res}  6,738,088    6.505521    3.450084          1         12
{txt}{space 8}mish {c |}{res}  6,738,088    6.003526    1.999997          4          8
{txt}{space 6}region {c |}{res}  6,738,088    27.35454    10.74259         11         42
{txt}{space 6}cpsidv {c |}{res}  6,738,088    2.00e+14    1.21e+12   1.98e+14   2.02e+14
{txt}{hline 13}{c +}{hline 57}
{space 9}age {c |}{res}  6,738,088    39.04488    12.23483         18         64
{txt}{space 9}sex {c |}{res}  6,738,088    1.487791    .4998509          1          2
{txt}{space 8}race {c |}{res}  6,738,088    142.7038    133.6738        100        830
{txt}{space 5}empstat {c |}{res}  6,738,088     10.0833    .3995664         10         12
{txt}{space 5}occ1950 {c |}{res}  6,738,088    421.1817    267.7166          0        970
{txt}{hline 13}{c +}{hline 57}
{space 5}ind1950 {c |}{res}  6,738,088    676.7314     222.289        105        936
{txt}{space 4}classwkr {c |}{res}  6,738,088    22.68014    2.121586         13         28
{txt}{space 3}uhrswork1 {c |}{res}  6,738,088    78.16546     189.717          0        997
{txt}{space 8}educ {c |}{res}  6,738,088    86.05168    23.06105          2        125
{txt}{space 6}earnwt {c |}{res}  6,738,088    8652.169    5093.023      90.01   209103.1
{txt}{hline 13}{c +}{hline 57}
{space 4}qearnwee {c |}{res}  4,437,930    1.275338    1.864099          0          4
{txt}{space 4}hourwage {c |}{res}  3,942,601    12.85596     8.72543        .01      99.99
{txt}{space 4}paidhour {c |}{res}  6,738,088    1.587672    .4922536          1          2
{txt}{space 7}union {c |}{res}  6,517,337    1.172239    .4198614          1          3
{txt}{space 4}earnweek {c |}{res}  6,701,139    710.0568    5298.886        .01    1000000
{txt}{hline 13}{c +}{hline 57}
{space 1}uhrsworkorg {c |}{res}  2,914,349    36.77634    9.983109          1         99
{txt}{space 6}female {c |}{res}  6,738,088    .4877906    .4998509          0          1
{txt}paidhour_d~y {c |}{res}  6,738,088    .4123278    .4922536          0          1
{txt}{space 3}race_orig {c |}{res}  6,738,088    142.7038    133.6738        100        830
{txt}{space 1}race_recode {c |}{res}  6,738,088    1.298572    .8411194          1          6
{txt}{hline 13}{c +}{hline 57}
{space 2}occupation {c |}{res}  6,738,088    3.936502     2.59726          1          9
{txt}{space 4}industry {c |}{res}  6,738,088    6.976406    2.776901          1         11
{txt}{space 7}grade {c |}{res}  6,738,088    13.49376    2.614426          0         18
{txt}{space 5}max_val {c |}{res}          1     1000000           .    1000000    1000000
{txt}{space 5}topcode {c |}{res}  6,701,139    .0222844     .147607          0          1
{txt}
{com}. 
. *** End part C
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\melin\OneDrive\ECO 727\Analysis\Exercise_2_Rueda.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}12 Jan 2025, 12:58:25
{txt}{.-}
{smcl}
{txt}{sf}{ul off}